SBI_Generator/YonoAuditTransLogs/config/high-throughput.yaml
# High Throughput Configuration
# Target: 10,000 EPS for 1 hour
# Use case: Load testing, stress testing

execution:
  mode: "duration"
  duration: "1h"
  count: 10000
  eps: 10000

distribution:
  error_only_percent: 0
  trans_only_percent: 70
  both_percent: 30

session:
  rotation_interval: "30s"
  session_id_prefix: "DSASLX6BkBafb"

templates:
  error:
    error_codes: ["BSee0e01", "BSeeeee1", "TEACS206", "TEACS207"]
    error_types: ["BUSINESS_EXCEPTION", "TECHNICAL_EXCEPTION"]
    error_descriptions:
      - '{"TEACS206":{"message":"Input provided is invalid"}}'
      - '{"TEACS207":{"message":"Account not found"}}'
    error_details: ["BUSINESS_EXCEPTION", "TECHNICAL_EXCEPTION"]
    created_by: "System"
    
  transaction:
    statuses:
      - weight: 90
        value: "success"
      - weight: 10
        value: "error"
    user_types: ["ETB_CUSTOMER", "NTB_CUSTOMER"]
    command_ids:
      - "statement_view"
      - "home_dashboard_cards_getAllCBSAccountSummary"
      - "home_dashboard_notification_getAllNotifications"
    channel_ids: [22, 23]
    user_relationship_numbers: ["02111764664914472", "82111764664914472"]
    biz_req_inputs:
      - '{"viewAccountStatementRequest":{"fromDate":null,"accountNo":"30096060714","toDate":null}}'
      - '{}'
    biz_resp_outputs:
      - '{}'
      - '{"response":"{\"ITERATE\":\"Y\",\"STATUS\":\"Y\"}"}'
    created_by: "System"

user_ids:
  mode: "fixed"
  fixed_list: [1212301889885902848, 1090951129735557800]
  range_min: 1000000000000000000
  range_max: 9999999999999999999

id_generation:
  transaction_id_pattern: "cRhKTOYInnV"
  request_no_length: 27
  trace_id_format: "hex"
  trace_id_length: 32

kafka:
  brokers: ["localhost:9092"]
  topic: "yono-audit-messages"
  producer:
    num_producers: 20              # Increased for high throughput
    required_acks: 1
    compression: "snappy"
    max_message_bytes: 1000000
    flush_frequency: "50ms"        # Faster flushing
    flush_messages: 100
    idempotent: false
    retry_max: 3
    retry_backoff: "100ms"
  connection:
    timeout: "10s"
    keep_alive: "30s"

concurrency:
  worker_pool_size: 200            # Increased for high throughput
  buffer_size: 5000                # Larger buffer
  rate_limiter_burst: 200          # Higher burst

logging:
  level: "info"
  format: "json"
  metrics_interval: "10s"

monitoring:
  enable_metrics: true
  metrics_port: 9090